FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC43xx/LPC43xx_SDRAM.h
/*-------------------------------------------------------------------------*
 * File:  LPC43xx_SDRAM.h
 *-------------------------------------------------------------------------*
 * Description:
 *     
 *-------------------------------------------------------------------------*/
#ifndef LPC43xx_SDRAM_H_
#define LPC43xx_SDRAM_H_

/*--------------------------------------------------------------------------
* uEZ(r) - Copyright (C) 2007-2015 Future Designs, Inc.
*--------------------------------------------------------------------------
* This file is part of the uEZ(r) distribution.
*
* uEZ(r) is free software; you can redistribute it and/or modify
* it under the terms of the GNU General Public License as published by
* the Free Software Foundation; either version 2 of the License, or
* (at your option) any later version.
*
* uEZ(r) is distributed in the hope that it will be useful,
* but WITHOUT ANY WARRANTY; without even the implied warranty of
* MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
* GNU General Public License for more details.
*
* You should have received a copy of the GNU General Public License
* along with uEZ(r); if not, write to the Free Software
* Foundation, Inc., 59 Temple Place, Suite 330, Boston, MA 02111-1307 USA
*
* A special exception to the GPL can be applied should you wish to
* distribute a combined work that includes uEZ(r), without being obliged
* to provide the source code for any proprietary components.  See the
* licensing section of http://goo.gl/UDtTCR for full details of how
* and when the exception can be applied.
*
*    *===============================================================*
*    |  Future Designs, Inc. can port uEZ(r) to your own hardware!   |
*    |             We can get you up and running fast!               |
*    |      See http://goo.gl/UDtTCR for more details.               |
*    *===============================================================*
*
*-------------------------------------------------------------------------*/

/*-------------------------------------------------------------------------*
 * Includes:
 *-------------------------------------------------------------------------*/
#include <Types/SDRAM.h>

/*-------------------------------------------------------------------------*
 * Constants:
 *-------------------------------------------------------------------------*/
// Calculate number of SDRAM cycles (rounded up)
#define SDRAM_CYCLES(x) \
    (1+((uint32_t)(((double)x)*(1.0/1000000000.0)* \
            ((double)SDRAM_CLOCK_FREQUENCY))))
#define SDRAM_CLOCKS(x) (x)

#define LPC43xx_SDRAM_CLKOUT0       0
#define LPC43xx_SDRAM_CLKOUT1       1

/*-------------------------------------------------------------------------*
 * Types:
 *-------------------------------------------------------------------------*/
typedef struct {
        // Base address for LPC43xx.  Can be one of the following (and changes
        // which bank of control pins to use).
        //     0x28000000 - Dynamic Memory Bank 0

        TUInt32 iBaseAddress;

        // Total size of memory in bytes
        TUInt32 iSize;

        // Number of CAS cycles, usually 2 or 3
        TUInt8 iCAS;

        // Number of RAS cycles, usually 2 or 3
        TUInt8 iRAS;

        // 0 for CLKOUT0 or 1 for CLKOUT1
        TUInt8 iClockOut;

        // SDRAM clock frequency (Hz)
        TUInt32 iClockFrequency;

        // SDRAM Refresh period in ms (example: 64 ms)
        TUInt32 iRefreshPeriod;

        // Number cycles per period (example: 8192 cycles)
        TUInt32 iRefreshCycles;

        // Timings for this SDRAM
        TUInt32 iDynamicRP;     // tRP min
        TUInt32 iDynamicRAS;    // tRAS min
        TUInt32 iDynamicSREX;   // tXSR min
        TUInt32 iDynamicAPR;    // tAPR/tRCD
        TUInt32 iDynamicDAL;    // tDAL clocks
        TUInt32 iDynamicWR;     // tWR
        TUInt32 iDynamicRC;     // tRC
        TUInt32 iDynamicRFC;    // tRFC
        TUInt32 iDynamicXSR;    // tXSR
        TUInt32 iDynamicRRD;    // tRRD
        TUInt32 iDynamicMRD;    // tMRD clocks
        // Example:
        //    sdramConfig->DynamicRP = SDRAM_CYCLES(20); // tRP min = 20 ns
        //    sdramConfig->DynamicRAS = SDRAM_CYCLES(42); // tRAS min = 42 ns
        //    sdramConfig->DynamicSREX = SDRAM_CYCLES(70); // use tXSR min = 70 ns
        //    sdramConfig->DynamicAPR = SDRAM_CYCLES(18); // no tAPR, using tRCD = 18 ns
        //    sdramConfig->DynamicDAL = SDRAM_CLOCKS(4); // for CL 2, tDAL = 4 tCK
        //    sdramConfig->DynamicWR = (SDRAM_CYCLES(6) + SDRAM_CLOCKS(1)); // tWR = tCK + 6ns
        //    sdramConfig->DynamicRC = SDRAM_CYCLES(60); // tRC min = 60 ns
        //    sdramConfig->DynamicRFC = SDRAM_CYCLES(60); // tRFC min = 60 ns
        //    sdramConfig->DynamicXSR = SDRAM_CYCLES(70); // tXSR min = 70 ns
        //    sdramConfig->DynamicRRD = SDRAM_CYCLES(12); // tRRD = 12 ns
        //    sdramConfig->DynamicMRD = SDRAM_CLOCKS(2); // tMRD = 2 tCK
} T_LPC43xx_SDRAM_Configuration;

/*-------------------------------------------------------------------------*
 * Prototypes:
 *-------------------------------------------------------------------------*/
void LPC43xx_SDRAM_Init_32BitBus(const T_LPC43xx_SDRAM_Configuration *aConfig);

/*
 * @brief LPC18xx/43xx EMC driver
 *
 * @note
 * Copyright(C) NXP Semiconductors, 2012
 * All rights reserved.
 *
 * @par
 * Software that is described herein is for illustrative purposes only
 * which provides customers with programming information regarding the
 * LPC products.  This software is supplied "AS IS" without any warranties of
 * any kind, and NXP Semiconductors and its licensor disclaim any and
 * all warranties, express or implied, including all implied warranties of
 * merchantability, fitness for a particular purpose and non-infringement of
 * intellectual property rights.  NXP Semiconductors assumes no responsibility
 * or liability for the use of the software, conveys no license or rights under any
 * patent, copyright, mask work right, or any other intellectual property rights in
 * or to any products. NXP Semiconductors reserves the right to make changes
 * in the software without notification. NXP Semiconductors also makes no
 * representation or warranty that such application will be suitable for the
 * specified use without further testing or modification.
 *
 * @par
 * Permission to use, copy, modify, and distribute this software and its
 * documentation is hereby granted, under NXP Semiconductors' and its
 * licensor's relevant copyrights in the software, without fee, provided that it
 * is used in conjunction with NXP Semiconductors microcontrollers.  This
 * copyright, permission, and disclaimer notice must appear in all copies of
 * this code.
 */

#ifndef __EMC_18XX_43XX_H_
#define __EMC_18XX_43XX_H_

#ifdef __cplusplus
extern "C" {
#endif

/** @defgroup EMC_18XX_43XX CHIP: LPC18xx/43xx External Memory Controller driver
 * @ingroup CHIP_18XX_43XX_Drivers
 * @{
 * The EMC interface clocks must be enabled outside this driver prior to
 * calling any function of this driver.
 */

/**
 * @brief External Memory Controller (EMC) register block structure
 */
typedef struct {                            /*!< EMC Structure          */
    __IO uint32_t  CONTROL;                 /*!< Controls operation of the memory controller. */
    __I  uint32_t  STATUS;                  /*!< Provides EMC status information. */
    __IO uint32_t  CONFIG;                  /*!< Configures operation of the memory controller. */
    __I  uint32_t  RESERVED0[5];
    __IO uint32_t  DYNAMICCONTROL;          /*!< Controls dynamic memory operation. */
    __IO uint32_t  DYNAMICREFRESH;          /*!< Configures dynamic memory refresh operation. */
    __IO uint32_t  DYNAMICREADCONFIG;       /*!< Configures the dynamic memory read strategy. */
    __I  uint32_t  RESERVED1;
    __IO uint32_t  DYNAMICRP;               /*!< Selects the precharge command period. */
    __IO uint32_t  DYNAMICRAS;              /*!< Selects the active to precharge command period. */
    __IO uint32_t  DYNAMICSREX;             /*!< Selects the self-refresh exit time. */
    __IO uint32_t  DYNAMICAPR;              /*!< Selects the last-data-out to active command time. */
    __IO uint32_t  DYNAMICDAL;              /*!< Selects the data-in to active command time. */
    __IO uint32_t  DYNAMICWR;               /*!< Selects the write recovery time. */
    __IO uint32_t  DYNAMICRC;               /*!< Selects the active to active command period. */
    __IO uint32_t  DYNAMICRFC;              /*!< Selects the auto-refresh period. */
    __IO uint32_t  DYNAMICXSR;              /*!< Selects the exit self-refresh to active command time. */
    __IO uint32_t  DYNAMICRRD;              /*!< Selects the active bank A to active bank B latency. */
    __IO uint32_t  DYNAMICMRD;              /*!< Selects the load mode register to active command time. */
    __I  uint32_t  RESERVED2[9];
    __IO uint32_t  STATICEXTENDEDWAIT;      /*!< Selects time for long static memory read and write transfers. */
    __I  uint32_t  RESERVED3[31];
    __IO uint32_t  DYNAMICCONFIG0;          /*!< Selects the configuration information for dynamic memory chip select n. */
    __IO uint32_t  DYNAMICRASCAS0;          /*!< Selects the RAS and CAS latencies for dynamic memory chip select n. */
    __I  uint32_t  RESERVED4[6];
    __IO uint32_t  DYNAMICCONFIG1;          /*!< Selects the configuration information for dynamic memory chip select n. */
    __IO uint32_t  DYNAMICRASCAS1;          /*!< Selects the RAS and CAS latencies for dynamic memory chip select n. */
    __I  uint32_t  RESERVED5[6];
    __IO uint32_t  DYNAMICCONFIG2;          /*!< Selects the configuration information for dynamic memory chip select n. */
    __IO uint32_t  DYNAMICRASCAS2;          /*!< Selects the RAS and CAS latencies for dynamic memory chip select n. */
    __I  uint32_t  RESERVED6[6];
    __IO uint32_t  DYNAMICCONFIG3;          /*!< Selects the configuration information for dynamic memory chip select n. */
    __IO uint32_t  DYNAMICRASCAS3;          /*!< Selects the RAS and CAS latencies for dynamic memory chip select n. */
    __I  uint32_t  RESERVED7[38];
    __IO uint32_t  STATICCONFIG0;           /*!< Selects the memory configuration for static chip select n. */
    __IO uint32_t  STATICWAITWEN0;          /*!< Selects the delay from chip select n to write enable. */
    __IO uint32_t  STATICWAITOEN0;          /*!< Selects the delay from chip select n or address change, whichever is later, to output enable. */
    __IO uint32_t  STATICWAITRD0;           /*!< Selects the delay from chip select n to a read access. */
    __IO uint32_t  STATICWAITPAG0;          /*!< Selects the delay for asynchronous page mode sequential accesses for chip select n. */
    __IO uint32_t  STATICWAITWR0;           /*!< Selects the delay from chip select n to a write access. */
    __IO uint32_t  STATICWAITTURN0;         /*!< Selects bus turnaround cycles */
    __I  uint32_t  RESERVED8;
    __IO uint32_t  STATICCONFIG1;           /*!< Selects the memory configuration for static chip select n. */
    __IO uint32_t  STATICWAITWEN1;          /*!< Selects the delay from chip select n to write enable. */
    __IO uint32_t  STATICWAITOEN1;          /*!< Selects the delay from chip select n or address change, whichever is later, to output enable. */
    __IO uint32_t  STATICWAITRD1;           /*!< Selects the delay from chip select n to a read access. */
    __IO uint32_t  STATICWAITPAG1;          /*!< Selects the delay for asynchronous page mode sequential accesses for chip select n. */
    __IO uint32_t  STATICWAITWR1;           /*!< Selects the delay from chip select n to a write access. */
    __IO uint32_t  STATICWAITTURN1;         /*!< Selects bus turnaround cycles */
    __I  uint32_t  RESERVED9;
    __IO uint32_t  STATICCONFIG2;           /*!< Selects the memory configuration for static chip select n. */
    __IO uint32_t  STATICWAITWEN2;          /*!< Selects the delay from chip select n to write enable. */
    __IO uint32_t  STATICWAITOEN2;          /*!< Selects the delay from chip select n or address change, whichever is later, to output enable. */
    __IO uint32_t  STATICWAITRD2;           /*!< Selects the delay from chip select n to a read access. */
    __IO uint32_t  STATICWAITPAG2;          /*!< Selects the delay for asynchronous page mode sequential accesses for chip select n. */
    __IO uint32_t  STATICWAITWR2;           /*!< Selects the delay from chip select n to a write access. */
    __IO uint32_t  STATICWAITTURN2;         /*!< Selects bus turnaround cycles */
    __I  uint32_t  RESERVED10;
    __IO uint32_t  STATICCONFIG3;           /*!< Selects the memory configuration for static chip select n. */
    __IO uint32_t  STATICWAITWEN3;          /*!< Selects the delay from chip select n to write enable. */
    __IO uint32_t  STATICWAITOEN3;          /*!< Selects the delay from chip select n or address change, whichever is later, to output enable. */
    __IO uint32_t  STATICWAITRD3;           /*!< Selects the delay from chip select n to a read access. */
    __IO uint32_t  STATICWAITPAG3;          /*!< Selects the delay for asynchronous page mode sequential accesses for chip select n. */
    __IO uint32_t  STATICWAITWR3;           /*!< Selects the delay from chip select n to a write access. */
    __IO uint32_t  STATICWAITTURN3;         /*!< Selects bus turnaround cycles */
} LPC_EMC_T;

/**
 * Dynamic Chip Select Address
 */
#define EMC_ADDRESS_DYCS0   (0x28000000)
#define EMC_ADDRESS_DYCS1   (0x30000000)
#define EMC_ADDRESS_DYCS2   (0x60000000)
#define EMC_ADDRESS_DYCS3   (0x70000000)

/**
 * Static Chip Select Address
 */
#define EMC_ADDRESS_CS0     (0x1C000000)
#define EMC_ADDRESS_CS1     (0x1D000000)
#define EMC_ADDRESS_CS2     (0x1E000000)
#define EMC_ADDRESS_CS3     (0x1F000000)

/**
 * @brief EMC register support bitfields and mask
 */
/* Reserve for extending support to ARM9 or nextgen LPC */
#define EMC_SUPPORT_ONLY_PL172  /*!< Reserve for extending support to ARM9 or nextgen LPC */

