FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC43xx/LPC43xx_SDRAM.h
/*!< Write Burst Mode in Dynamic Mode register */
#define EMC_DYN_MODE_WBMODE_BIT             (9)                         /*!< Write Burst Mode bit */
#define EMC_DYN_MODE_WBMODE_PROGRAMMED  (0 << EMC_DYN_MODE_WBMODE_BIT)  /*!< Write Burst Mode programmed */
#define EMC_DYN_MODE_WBMODE_SINGLE_LOC  (1 << EMC_DYN_MODE_WBMODE_BIT)  /*!< Write Burst Mode Single LOC */

/*!< Dynamic Memory Control Register Bit Definitions */
#define EMC_DYN_CONTROL_ENABLE          (0x03)  /*!< Control Enable value */

/*!< Static Memory Configuration Register Bit Definitions */
#define EMC_STATIC_CONFIG_MEM_WIDTH_8       (0) /*!< Static Memory Configuration - 8-bit width */
#define EMC_STATIC_CONFIG_MEM_WIDTH_16      (1) /*!< Static Memory Configuration - 16-bit width */
#define EMC_STATIC_CONFIG_MEM_WIDTH_32      (2) /*!< Static Memory Configuration - 32-bit width */

#define EMC_STATIC_CONFIG_PAGE_MODE_BIT         (3)                                     /*!< Page Mode bit No */
#define EMC_STATIC_CONFIG_PAGE_MODE_ENABLE      (1 << EMC_STATIC_CONFIG_PAGE_MODE_BIT)  /*!< Value to enable Page Mode */

#define EMC_STATIC_CONFIG_CS_POL_BIT            (6)                                 /*!< Chip Select bit No */
#define EMC_STATIC_CONFIG_CS_POL_ACTIVE_HIGH    (1 << EMC_STATIC_CONFIG_CS_POL_BIT) /*!< Chip Select polarity - Active High */
#define EMC_STATIC_CONFIG_CS_POL_ACTIVE_LOW     (0 << EMC_STATIC_CONFIG_CS_POL_BIT) /*!< Chip Select polarity - Active Low */

#define EMC_STATIC_CONFIG_BLS_BIT           (7)                             /*!< BLS Configuration bit No */
#define EMC_STATIC_CONFIG_BLS_HIGH          (1 << EMC_STATIC_CONFIG_BLS_BIT)    /*!< BLS High Configuration value */
#define EMC_STATIC_CONFIG_BLS_LOW           (0 << EMC_STATIC_CONFIG_BLS_BIT)    /*!< BLS Low Configuration value */

#define EMC_STATIC_CONFIG_EW_BIT            (8)                             /*!< Ext Wait bit No */
#define EMC_STATIC_CONFIG_EW_ENABLE         (1 << EMC_STATIC_CONFIG_EW_BIT) /*!< Ext Wait Enabled value */
#define EMC_STATIC_CONFIG_EW_DISABLE        (0 << EMC_STATIC_CONFIG_EW_BIT) /*!< Ext Wait Diabled value */

/*!< Q24.8 Fixed Point Helper */
#define Q24_8_FP(x) ((x) * 256)
#define EMC_NANOSECOND(x)   Q24_8_FP(x)
#define EMC_CLOCK(x)        Q24_8_FP(-(x))

/**
 * @brief   EMC Dynamic Device Configuration structure used for IP drivers
 */
typedef struct {
    uint32_t    BaseAddr;       /*!< Base Address */
    uint8_t     RAS;            /*!< RAS value */
    uint32_t    ModeRegister;   /*!< Mode Register value */
    uint32_t    DynConfig;      /*!< Dynamic Configuration value */
} IP_EMC_DYN_DEVICE_CONFIG_T;

/**
 * @brief EMC Dynamic Configure Struct
 */
typedef struct {
    int32_t RefreshPeriod;                          /*!< Refresh period */
    uint32_t ReadConfig;                            /*!< Clock*/
    int32_t tRP;                                    /*!< Precharge Command Period */
    int32_t tRAS;                                   /*!< Active to Precharge Command Period */
    int32_t tSREX;                                  /*!< Self Refresh Exit Time */
    int32_t tAPR;                                   /*!< Last Data Out to Active Time */
    int32_t tDAL;                                   /*!< Data In to Active Command Time */
    int32_t tWR;                                    /*!< Write Recovery Time */
    int32_t tRC;                                    /*!< Active to Active Command Period */
    int32_t tRFC;                                   /*!< Auto-refresh Period */
    int32_t tXSR;                                   /*!< Exit Selt Refresh */
    int32_t tRRD;                                   /*!< Active Bank A to Active Bank B Time */
    int32_t tMRD;                                   /*!< Load Mode register command to Active Command */
    IP_EMC_DYN_DEVICE_CONFIG_T DevConfig[4];        /*!< Device Configuration array */
} IP_EMC_DYN_CONFIG_T;

/**
 * @brief EMC Static Configure Structure
 */
typedef struct {
    uint8_t ChipSelect;     /*!< Chip select */
    uint32_t Config;        /*!< Configuration value */
    int32_t WaitWen;        /*!< Write Enable Wait */
    int32_t WaitOen;        /*!< Output Enable Wait */
    int32_t WaitRd;         /*!< Read Wait */
    int32_t WaitPage;       /*!< Page Access Wait */
    int32_t WaitWr;         /*!< Write Wait */
    int32_t WaitTurn;       /*!< Turn around wait */
} IP_EMC_STATIC_CONFIG_T;


/**
 * @}
 */

#ifdef __cplusplus
}
#endif

#endif /* __EMC_18XX_43XX_H_ */


#endif // LPC43xx_SDRAM_H_
/*-------------------------------------------------------------------------*
 * End of File:  LPC43xx_SDRAM.h
 *-------------------------------------------------------------------------*/
